Revit 2027 API
LinkLoadResult(LinkLoadResult) Constructor
 Constructs a new copy of the input LinkLoadResult object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkLoadResult(
	LinkLoadResult other
)
Public Sub New (
	other As LinkLoadResult
)
public:
LinkLoadResult(
	LinkLoadResult^ other
)
new :
        other : LinkLoadResult -> LinkLoadResult
Parameters
other LinkLoadResult
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinkLoadResult Class
LinkLoadResult Overload
Autodesk.Revit.DB Namespace